---
kind: property
id: P:Autodesk.Revit.DB.TextNode.VerticalAlignment
source: html/308a384e-179b-a314-d0d6-ccbe78a4341c.htm
---
# Autodesk.Revit.DB.TextNode.VerticalAlignment Property

Indicates default vertical alignment of the text.

## Syntax (C#)
```csharp
public VerticalTextAlignment VerticalAlignment { get; }
```